quantummongolia/industrial-iot/esp32_firmware/lab/src/main.cpp
  // ---- Firebase delivery watchdog ----
  // WiFi асан, Firebase.ready()==true мөртөө бичилт сервер хүрэхгүй (token хүчинтэй ч
  // доорх TCP/TLS session үхсэн "дүлий" төлөв) бол дээрх !Firebase.ready() болзол
  // ХЭЗЭЭ Ч барихгүй. Иймд сүүлийн амжилттай Firebase контактаас MAX_OFFLINE_MS
  // хэтэрвэл цэвэр reset хийж шинээр холбогдоно.
  if (firebaseReady && WiFi.status() == WL_CONNECTED &&
      ota::lastContactMs() != 0 &&
      now - ota::lastContactMs() >= cfg::MAX_OFFLINE_MS) {
    Serial.println("[Watchdog] Firebase delivery stalled — clean restart");
    Serial.flush();
    delay(200);
    ESP.restart();
  }

  if (WiFi.status() != WL_CONNECTED &&
      now - lastWifiCheck >= cfg::WIFI_RETRY_MS) {
    lastWifiCheck = now;
    Serial.println("[WiFi] retry — async reconnect");
    WiFi.reconnect();
  }

  static unsigned long lastPoll = 0;
  if (now - lastPoll < cfg::POLL_MS)
    return;
  lastPoll = now;

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("[WiFi] not connected");
    led::setMode(led::SLOW_RED);
    return;
  }

  // Boot үед уншиж чадаагүй CT primary-уудыг дахин оролдох — нэг slave/cycle.
  {
    static const uint8_t spmSlaves[2] = {cfg::EM16_SLAVE, cfg::EM17_SLAVE};
    for (uint8_t s : spmSlaves) {
      if (!ctPrimaryKnown[s]) {
        Spm33_readCtPrimary(modbus, s);
        delay(cfg::FRAME_GAP_MS);
        break; // зөвхөн нэгийг л оролдоно
      }
    }
  }

  // Цикл бүрд flow-cycle (power) эсвэл totalizer-cycle (energy) гэсэн 2 төрлийн
  // нэг нь явна. RS485 bus-н ачааллыг бууруулж, energy-г тусад нь 1 минутын циклд
  // уншина. Boot-ийн дараа нэг удаа energy-г шууд уншиж cache-г бөглөнө.
  bool totalizerCycle = (lastTotalizerReadTime == 0) ||
                        (now - lastTotalizerReadTime >= cfg::TOTALIZER_INTERVAL_MS);

  Spm33Reading em16, em17;

  if (totalizerCycle) {
    // ── Totalizer cycle: EM16 + EM17 энерги
    lastTotalizerReadTime = now;
    Serial.println("[Cycle] Totalizer read (1 min interval)");

    em16 = Spm33_readEnergy(modbus, cfg::EM16_SLAVE);
    if (em16.energyOk) { cachedEm16EnergyKWh = em16.energyKWh; cachedEm16EnergyValid = true; }
    delay(cfg::FRAME_GAP_MS);

    em17 = Spm33_readEnergy(modbus, cfg::EM17_SLAVE);
    if (em17.energyOk) { cachedEm17EnergyKWh = em17.energyKWh; cachedEm17EnergyValid = true; }
    delay(cfg::FRAME_GAP_MS);

    Serial.printf("[Totalizer] EM16:%s EM17:%s\n",
                  em16.energyOk ? String(em16.energyKWh, 1).c_str() : "#",
                  em17.energyOk ? String(em17.energyKWh, 1).c_str() : "#");
  } else {
    // ── Flow cycle: EM16 + EM17 power
    em16 = Spm33_readPower(modbus, cfg::EM16_SLAVE);
    delay(cfg::FRAME_GAP_MS);
    em17 = Spm33_readPower(modbus, cfg::EM17_SLAVE);
    delay(cfg::FRAME_GAP_MS);

    Serial.printf("[Flow] EM16:%s EM17:%s\n",
                  em16.powerOk ? String(em16.powerKW, 2).c_str() : "#",
                  em17.powerOk ? String(em17.powerKW, 2).c_str() : "#");
  }

  // ── Алдаа escalate ──────────────────────────────────────────────
  bool anyOk = em16.powerOk || em16.energyOk || em17.powerOk || em17.energyOk;
  if (anyOk) {
    consecutiveReadFails = 0;
    totalRecoveryAttempts = 0;
  } else {
    consecutiveReadFails++;
    if (consecutiveReadFails >= cfg::MAX_CONSECUTIVE_FAILS)
      recoverModbusBus();
  }

  // ── Firebase upload — /energy_meters subtree-г жижиг updateNode-оор бичнэ.
  if (!fbCanUpload()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!Firebase.ready()) {
    led::setMode(led::SLOW_RED);
    return;
  }
  if (!firebaseReady) {
    firebaseReady = true;
    Serial.println("[Firebase] ready");
    ota::begin(&fbData);  // DEVICE_ID register + командын stream нээх
  }

  // ─ /energy_meters/{em16,em17} ──────────────────────────────────────
  // Flow cycle: power_kw (instantaneous)
  // Totalizer cycle: total_energy_kwh (cumulative)
  bool emOk = true;
  bool emAny = false;
  {
    FirebaseJson j;
    auto addEm = [&](const char *id, const Spm33Reading &r, LiveState &lv) {
      String base = String(id) + "/";
      if (totalizerCycle) {
        if (r.energyOk) {
          j.set((base + "total_energy_kwh").c_str(), r.energyKWh);
          emAny = true;
        }
      } else {
        if (r.powerOk) {
          j.set((base + "power_kw").c_str(), liveValue(r.powerKW, lv));
          emAny = true;
        }
      }
    };
    addEm("em16", em16, lvEm16);
    addEm("em17", em17, lvEm17);
    if (emAny) {
      emOk = Firebase.RTDB.updateNodeSilent(&fbData, "/energy_meters", &j);
      if (!emOk)
        Serial.printf("[Firebase] /energy_meters ERROR: %s\n",
                      fbData.errorReason().c_str());
    }
  }

  if (!emAny) {
    led::setMode(led::SLOW_RED);
    return;
  }

  if (emOk) {
    Serial.println("[Firebase] Updated");
    fbOnSuccess();
    ota::noteFbSuccess(); // delivery watchdog-ийн \"амьд\" тэмдэг
    led::setMode(led::OFF);
    led::pulse();
  } else {
    fbOnFailure();
    led::setMode(led::SLOW_RED);
  }

  // OTA heartbeat + self-test gate (амжилттай upload бүрд +1)
  ota::loop(&fbData, emOk);
}
